{"config": {"layers": [{"config": {"filters": 64, "bias_constraint": null, "trainable": true, "padding": "valid", "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "batch_input_shape": [null, 48, 48, 1], "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}, "strides": [1, 1], "activity_regularizer": null, "name": "conv2d_1", "use_bias": true, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"filters": 64, "bias_constraint": null, "trainable": true, "padding": "same", "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "name": "conv2d_2", "use_bias": true, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"momentum": 0.99, "scale": true, "beta_regularizer": null, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "name": "batch_normalization_1", "epsilon": 0.001, "beta_constraint": null, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"dtype": "float32", "trainable": true, "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"noise_shape": null, "dtype": "float32", "seed": null, "trainable": true, "name": "dropout_1", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"filters": 128, "bias_constraint": null, "trainable": true, "padding": "same", "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "name": "conv2d_3", "use_bias": true, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"momentum": 0.99, "scale": true, "beta_regularizer": null, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "name": "batch_normalization_2", "epsilon": 0.001, "beta_constraint": null, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"filters": 128, "bias_constraint": null, "trainable": true, "padding": "same", "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "name": "conv2d_4", "use_bias": true, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"momentum": 0.99, "scale": true, "beta_regularizer": null, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "name": "batch_normalization_3", "epsilon": 0.001, "beta_constraint": null, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"dtype": "float32", "trainable": true, "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_2", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"noise_shape": null, "dtype": "float32", "seed": null, "trainable": true, "name": "dropout_2", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"filters": 256, "bias_constraint": null, "trainable": true, "padding": "same", "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "name": "conv2d_5", "use_bias": true, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"momentum": 0.99, "scale": true, "beta_regularizer": null, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "name": "batch_normalization_4", "epsilon": 0.001, "beta_constraint": null, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"filters": 256, "bias_constraint": null, "trainable": true, "padding": "same", "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "name": "conv2d_6", "use_bias": true, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"momentum": 0.99, "scale": true, "beta_regularizer": null, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "name": "batch_normalization_5", "epsilon": 0.001, "beta_constraint": null, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"dtype": "float32", "trainable": true, "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_3", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"noise_shape": null, "dtype": "float32", "seed": null, "trainable": true, "name": "dropout_3", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"filters": 512, "bias_constraint": null, "trainable": true, "padding": "same", "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "name": "conv2d_7", "use_bias": true, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"momentum": 0.99, "scale": true, "beta_regularizer": null, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "name": "batch_normalization_6", "epsilon": 0.001, "beta_constraint": null, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"filters": 512, "bias_constraint": null, "trainable": true, "padding": "same", "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "name": "conv2d_8", "use_bias": true, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"momentum": 0.99, "scale": true, "beta_regularizer": null, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "name": "batch_normalization_7", "epsilon": 0.001, "beta_constraint": null, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"dtype": "float32", "trainable": true, "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_4", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"noise_shape": null, "dtype": "float32", "seed": null, "trainable": true, "name": "dropout_4", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"dtype": "float32", "name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "trainable": true, "dtype": "float32", "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 512, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "name": "dense_1", "use_bias": true}, "class_name": "Dense"}, {"config": {"noise_shape": null, "dtype": "float32", "seed": null, "trainable": true, "name": "dropout_5", "rate": 0.4}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "trainable": true, "dtype": "float32", "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 256, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "name": "dense_2", "use_bias": true}, "class_name": "Dense"}, {"config": {"noise_shape": null, "dtype": "float32", "seed": null, "trainable": true, "name": "dropout_6", "rate": 0.4}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "trainable": true, "dtype": "float32", "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 128, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "name": "dense_3", "use_bias": true}, "class_name": "Dense"}, {"config": {"noise_shape": null, "dtype": "float32", "seed": null, "trainable": true, "name": "dropout_7", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "trainable": true, "dtype": "float32", "activation": "softmax", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 7, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "name": "dense_4", "use_bias": true}, "class_name": "Dense"}], "name": "sequential_1"}, "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.3.1"}